#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
//不能简单的用代码思考，一开始要学会用普通的方式思考
//进而转换成数学问题，再用代码实现
//这就需要C语言语法

//从模仿 - 不断思考 - 自己实现//模仿是非常重要的手段
//学会调试代码 - 感受代码的执行 - 


//第1题

//int main()
//{
//	int i = 0;
//	for (i = 0; i < 10;i++)
//	{
//		if (i = 5)
//			printf("%d ", i);
//	}
//	return 0;
//}

//第4题

//int func(int a)
//{
//	int b;
//	switch (a)
//	{
//	case 1:b = 30;
//	case 2:b = 20;
//	case 3:b = 16;
//	default:b = 0;
//	}
//	return b;
//}
//
//int main()
//{
//	int x = 0;
//	scanf("%d", &x);
//	printf("%d", func(x));
//
//	return 0;
//}

//F11 - 逐语句
//F10 - 逐过程

//第6题

//int main()
//{
//	int x = 3;
//	int y = 3;
//	switch (x % 2)
//	{
//	case 1:
//		switch (y)//y是多久，就会从该数字的case进去
//		{
//		case 0:printf("first");
//		case 1:printf("second"); break;
//
//		default:printf("hello");
//		}
//	case 2:
//		printf("third");
//	}
//	return 0;
//}

//第7题(编程题)
//从大到小输出

//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	//输入
//	scanf("%d%d%d", &a, &b, &c);//输入一个数字后必须加 空格或回车 才算输入完成
//
//	//调整顺序
//	if (a < b)
//	{
//		int tmp = a;
//		a = b;
//		b = tmp;
//	}
//	if (a < c)
//	{
//		int tmp = a;
//		a = c;
//		c = tmp;
//	}
//	if (b < c)//括号内的调换大小的内容格式完全一致。后期可以写个函数来简化
//	{
//		int tmp = b;
//		b = c;
//		c = tmp;
//	}
//	//输出 - 大到小
//	printf("%d %d %d", a,b,c);
//	return 0;
//}

//第8题
//打印3的倍数
//1 - 100之间

//int main()
//{
//	int i = 0;
//	//for (i = 1; i <= 100; i++)
//	//{
//	//	//判断i是否为3的倍数
//	//	if (i % 3 == 0)
//	//	{
//	//		printf("%d ", i);
//	//	}
//	//		
//	//}
//	
//	//也可以不判断，直接打印3的倍数
//	for (i = 3; i <= 100; i += 3)//省去判断，直接打印出结果
//	{                            //要敢想，学会动脑筋
//		printf("%d ", i);
//	}
//
//	return 0;
//}

//第9题
//最大公约数
//给定两个数，求两个数的最大公约数


//我的方法

//int main()
//{
//	int m = 0;
//	int n = 0;
//	scanf("%d%d", &m, &n);//24 18
//	//尝试去寻找那个数字能同时整除24和18 - 我猜是6吧
//
//	//if (m < n)//可读性低，换一种
//	//{
//	//	int tmp = m;
//	//	m = n;
//	//	n = tmp;
//	//}
//	int min = 0;
//	//找到m和n中的最小值
//	if (m < n)
//	{
//		min = m;
//	}
//	else
//	{
//		min = n;
//	}
//	
//	for(int i = min; i > 0; i--)//从最小的那个数，每次减1，一个个试，一直到1
//	{
//		if (m % i == 0 && n % i == 0)//当i能同时整除m和n时
//		{
//			printf("最大公约数是：%d\n", i);//此时i为最大公约数，输出
//			break;//并跳出循环
//		}
//	}
//	return 0;
//}


//老师的方法
//1、普通 - 简单想想法 
//使用的while循环

//int main()
//{
//	int m = 0;
//	int n = 0;
//	scanf("%d%d", &m, &n);//24 18
//	//尝试去寻找那个数字能同时整除24和18 - 我猜是6吧
//
//	int max = 0;//设max变量为最大公约数
//	//max初始取值是m和n中较小的那个
//	if (m > n)
//	{
//		max = n;
//	}
//	else
//	{
//		max = m;
//	}
//
//	//就把max当成最大公约数去用，不满足表达式，就每次减1
//
//	while(1)//死循环，直到满足条件才能跳出循环
//	{
//		if (m % max == 0 && n % max== 0)//当max能同时整除m和n时
//		{
//			printf("最大公约数是：%d\n", max);//此时i为最大公约数，输出
//			break;//并跳出循环//if不算循环，也就是跳出外面的循环
//		}
//		max--;//如果不满足，就每次减1
//	}
//
//	return 0;
//}

//2、辗转相除法

//int main()
//{
//	int m = 0;
//	int n = 0;
//	scanf("%d%d", &m, &n);//24 18
//	int t = 0;//辗转相除法一般不可能一次，故需要一个中间变量
//
//	while (t =m % n)//非0为真，则可以循环
//	{
//		//t = m % n;//可以直接放在while()的括号中，判断的同时完成赋值//是可行的
//		m = n;
//		n = t;
//	}
//	printf("最大公约数：%d\n", n);
//  //最小公倍数 = m*n/最大公约数
//	return 0;
//}//可以顺带着想一想最小公倍数怎么求

//测试，取模运算
//int main()
//{
//	printf("%d\n", 24 % 18);
//	printf("%d\n", 18 % 24);//结果为18，商0余18
//
//	return 0;
//}

//打印1000 - 2000之间的闰年

//方法一
//int main()
//{
//	int  y = 0;
//	int count = 0;//数一数有几个闰年
//	for (y = 1000; y <= 2000; y++)
//	{
//		//判断y是不是闰年
//		//1、被4整除，不能被100整除是闰年
//		//2、能被400整除是闰年
//		if (y % 4 == 0)
//		{
//			if (y % 100 != 0)
//			{
//				printf("%d ", y);
//				count++;
//			}
//		}
//
//		if (y % 400 == 0)
//		{
//			printf("%d ", y);
//			count++;
//		}
//	}
//	printf("\ncount= %d\n", count);
//
//	return 0;
//}

//方法二//其实就是简化了一下代码
//int main()
//{
//	int  y = 0;
//	int count = 0;//数一数有几个闰年
//	for (y = 1000; y <= 2000; y++)
//	{
//		//判断y是不是闰年
//		//1、被4整除，不能被100整除是闰年
//		//2、能被400整除是闰年
//		//其实判断闰年的规则只要满足一个就行
//		if (((y % 4 == 0) && (y % 100 != 0)) || (y % 400 == 0))
//		{
//			printf("%d ", y);
//			count++;
//		}//此种方法需要理解 并且 或者 的操作符
//	}
//	printf("\ncount= %d\n", count);
//
//	return 0;
//}

//写一个代码：打印100-200之间的素数
//素数 - 质数
//只能被1和它本身整除
//int main()
//{
//	int i = 0;
//	for (i = 100; i <= 200; i++)
//	{
//		//判断i是否为素数
//		//2->i-1之间的数字去试除，看能不能整除
//		//只要有一个数能够整除它，就能证明它不是素数
//		int j = 0;
//
//		for (j = 2; j < i; j++)
//		{
//			if (i % j == 0)
//			{
//				break;
//			}
//		}
//		//来到这里时：1、发现不是素数的数，跳出了循环
//		            //2、都试除了一遍，发现没有素数
//		if (i == j)
//		{
//			printf("%d ", i);//素数
//		}
//	}
//	return 0;
//}


//int main()
//{
//	int i = 0;
//	int count = 0;
//	for (i = 100; i <= 200; i++)
//	{
//		//判断i是否为素数
//		//2->i-1之间的数字去试除，看能不能整除
//		//只要有一个数能够整除它，就能证明它不是素数
//		int j = 0;
//		int flag = 1;//假设，就是素数
//		//flag是标记，易读性提升
//
//		for (j = 2; j < i; j++)
//		{
//			if (i % j == 0)
//			{
//				flag = 0;//不是素数
//				break;
//			}
//		}
//		//来到这里时：1、发现不是素数的数，跳出了循环
//					//2、都试除了一遍，发现没有素数
//		if (flag == 1)
//		{
//			count++;
//			printf("%d ", i);//素数
//		}
//	}
//	printf("\ncount = %d\n", count);
//
//	return 0;
//}


//#include<math.h>
////代码再优化
//int main()
//{
//	int i = 0;
//	int count = 0;
//	
//	//m = a*b
//	//a和b中一定有一个数字是<=开平方m的
//	//16 = 2*8 = 4*4
//
//	//sqrt - 是开平方的函数
//	
//	for (i = 100; i <= 200; i++)
//	{
//		//判断i是否为素数
//		//2->i-1之间的数字去试除，看能不能整除
//		//只要有一个数能够整除它，就能证明它不是素数
//		int j = 0;
//		int flag = 1;//假设，就是素数
//		//flag是标记，易读性提升
//
//		for (j = 2; j <= sqrt(i); j++)//多思考//试除的次数减少了
//		{
//			if (i % j == 0)
//			{
//				flag = 0;//不是素数
//				break;
//			}
//		}
//		//来到这里时：1、发现不是素数的数，跳出了循环
//					//2、都试除了一遍，发现没有素数
//		if (flag == 1)
//		{
//			count++;
//			printf("%d ", i);//素数
//		}
//	}
//	printf("\ncount = %d\n", count);
//
//	return 0;
//}


#include<math.h>
//代码再再优化
int main()
{
	int i = 0;
	int count = 0;

	//m = a*b
	//a和b中一定有一个数字是<=开平方m的
	//16 = 2*8 = 4*4

	//sqrt - 是开平方的函数

	for (i = 101; i <= 200; i+=2)//偶数不可能是素数//从源头跳过偶数
	{
		//判断i是否为素数
		//2->i-1之间的数字去试除，看能不能整除
		//只要有一个数能够整除它，就能证明它不是素数
		int j = 0;
		int flag = 1;//假设，就是素数
		//flag是标记，易读性提升

		for (j = 2; j <= sqrt(i); j++)//多思考//试除的次数减少了
		{
			if (i % j == 0)
			{
				flag = 0;//不是素数
				break;
			}
		}
		//来到这里时：1、发现不是素数的数，跳出了循环
					//2、都试除了一遍，发现没有素数
		if (flag == 1)
		{
			count++;
			printf("%d ", i);//素数
		}
	}
	printf("\ncount = %d\n", count);

	return 0;
}//多见见别人的代码