#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//2021-05-07_操作符的使用等_作业
//第5题 编程题
//统计二进制中1的个数
//写一个函数返回参数二进制中1的个数
//比如：15 00001111 4个1
// 
//NumberOf1 就是计算参数n的二进制补码中有几个
//123
//123%10 = 3
//123/10 = 12
//12%10 = 2
//12/10 = 1
//1%10 = 1
//1/10 = 0
//
//15 - 00001111
//15%2 = 1
//15/2 = 7 - 00000111
//7%2 = 1
//7/2 = 3 - 00000011
//3%2 = 1
//3/2 = 1 - 00000001
//1%2 = 1
//1/2 = 0 - 00000000
//

//14 - 00001110
//14%2 = 0
//14/2 = 7 00000111

//int NumberOf1(int n)
//{
//	//很多在线刷题，只需要完成函数
//	int count = 0;
//	while (n)
//	{
//		if (n % 2 == 1)
//		{
//			count++;
//		}
//		n /= 2;
//	}
//	return count;
//}//不适用于负数

//方法二
//int NumberOf1(int n)
//{
//	int count = 0;
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (((n >> i) & 1) == 1)
//		{
//			count++;
//		}
//	}
//	return count;
//}

//方法三
//int NumberOf1(int n)
//{
//	int count = 0;
//	int i = 0;
//	while (n)
//	{
//		n = n & (n - 1);//训练学习这种简单的方法
//		count++;
//	}
//	return count;
//}
//
//
//int main()
//{
//	int n = 15;//-1时，需要再考虑考虑
//	int ret = NumberOf1(n);
//
//	printf("ret = %d\n", ret);
//	return 0;
//}//要慢慢分析代码

//n = n&(n-1)//去掉最右边的1
//n =15
//1111 - n
//1110 - n-1 
//1110 - n
//1101 - n-1 
//1100 - n 
//1011 - n-1 
//1000 - n 
//0111 - n-1
//0000 - n 
//

//老师附加题
//写一个代码判断一个数字是不是2的n次方
//2的n次方的数组，其中只有一个
//k&(k-1) == 0
//


//第3题 编程题
//求两个数二进制中不同位的个数
//编程实现：两个int（32位）整数m和n的二进制表达中，有多少个位（bit）不同？
//输入例子：1999 2299 
//输出例子：7

//int NumberOf1(int n)
//{
//	int count = 0;
//	int i = 0;
//	while (n)
//	{
//		n = n & (n - 1);//训练学习这种简单的方法
//		count++;
//	}
//	return count;
//}
//
//int main()
//{
//	int m = 0;
//	int n = 0;
//	int i = 0;
//	int count = 0;
//
//	scanf("%d %d", &m, &n);
//
//	//另一种方法
//	//m和n异或一下
//	int ret = m ^ n;//相同为0，相异位1
//	//统计一下ret的2进制中有几个1，就说明m和n的2进制中有几个位不同
//	
//	count = NumberOf1(ret);//秒啊
//
//	//硬比较法
//	/*for (i = 0; i < 32; i++)
//	{
//		if (((m >> i) & 1) != ((n >> i) & 1))
//		{
//			count++;
//		}
//	}*/
//	printf("%d\n", count);
//
//	return 0;
//}


//第4题 编程题
//打印整数二进制的奇数位和偶数位
//获取一个整数二进制序列中所有的偶数位和奇数位，分别打印出二进制序列
//int main()
//{
//	int n = 0;
//	scanf("%d",&n);
//	//获取n的2进制中的奇数位和偶数位
//	//00000000000000000000000000001010
//	int i = 0;
//	//打印偶数位
//	for (i = 31; i >= 1; i -= 2)
//	{
//		printf("%d ", (n >> i) & 1);
//	}
//	printf("\n");
//	//打印奇数位
//	for (i = 30; i >= 0; i -= 2)
//	{
//		printf("%d ", (n >> i) & 1);
//	}
//
//	return 0;
//}//好好想想 - 主要用到了操作符


//第6题 编程题
//交换两个变量（不创建临时变量）
//不允许创建临时变量，交换两个整数的内容 - 用异或

int main()
{
	int a = 10;
	int b = 20;
	a = a ^ b;
	b = a ^ b;//a^b^b
	a = a ^ b;//a^b^a
	printf("a = %d  b= %d", a, b);

	return 0;
}



//2021-05-09_算数转换等_作业