#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//程序的输出结果是

//int main()
//{
//	int a = 0, b = 0;
//	for (a = 1, b = 1; a <= 100; a++)
//	{
//		if (b >= 20)break;
//		if (b % 3 == 1)
//		{
//			b = b + 3;
//			continue;
//		}
//		b = b - 5;
//	}
//	printf("%d\n", a);
//	return 0;
//}

//第3题 编程题
//数9的个数
//编写程序数一下1到100的所有整数中出现多少个数字9
//9 19 29 39 49 59 69 79 89 99 个位9
//90 91 92.....99 十位9

//int main()
//{
//	int i = 0;
//	int count = 0;
//	for (i = 1; i <= 100; i++)
//	{
//		if (i % 10 == 9)
//			count++;
//		if (i / 10 == 9)
//			count++;
//	}
//	printf("%d\n", count);
//	return 0;
//}

//第4题 编程题
//分数求和
//计算1/1-1/2+1/3-1/4+1/5......+1/99-1/100的值，打印出结果


//方法一
//int main()
//{
//	int i = 0;
//	double sum = 0;
//	
//	for (i = 1; i <= 100; i++)
//	{
//		if (i % 2 == 0)
//			sum -= 1.0 / i;
//		else
//			sum += 1.0 / i;
//	}
//	printf("%lf\n", sum);
//
//	return 0;
//}

//本题要想做对，就要理解，如何做到加减交替
//方法二
//int main()
//{
//	int i = 0;
//	double sum = 0;
//	int flag = 1;
//	for (i = 1; i <= 100; i++)
//	{
//			sum += flag*1.0 / i;
//			flag = -flag;//这样也能加减交替
//	}
//	printf("%lf\n", sum);
//
//	return 0;
//}

//第5题 编程题
//求最大值
//求10个整数中的最大值

//int main()
//{
//	int arr[10] = { -1,-2,-3,-4,-5,-6,-7,-8,-9,-10 };
//	int max = arr[0];//目的：要写通用的代码
//	int i = 0;
//	for (i = 0; i < 10; i++)//下标从0到9
//	{
//		if (arr[i] > max)//出现的问题，如果数组的值都小于max，那么就找不到最大值
//		{
//			max = arr[i];
//		}
//	}
//	printf("%d\n", max);
//
//	return 0;
//}

//第6题 编程题
//乘法口诀表
//在屏幕上输出9*9乘法口诀表
//1*1=1
//2*1=2 2*2=4
//3*1=3 3*2=6 3*3=9
//....

int main()
{
	int i = 0;
	//行数
	for (i = 1; i <= 9; i++)
	{
		//打印一行
		int j = 0;
		for (j = 1; j <= i; j++)
		{
			printf("%d*%d=%-2d ", i, j, i * j);//%2d - 打印两位，不够的用空格填上 - 默认右对齐，加-变左对齐
		}
		printf("\n");
	}
	return 0;
}

//第7题 编程题
//猜数字游戏
//完成上课的猜数字游戏 - 写过了

//第8题 编程题
//二分查找
//编写代码在一个整型有序数组中查找具体的某个数 - 写过了

//设计函数时尽量做到谁申请的资源就由谁来释放

//第5题 编程题
//函数判断素数
//实现一个函数，判断一个数是不是素数
//利用上面实现的函数打印100-200之间的素数 - 写过了