#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
//操作符

//除号操作符
//int main()
//{
//	//int a = 3 / 5;//0.6
//	//printf("%d\n", a);
//	
//	/*float a = 6 / 5;
//	printf("%f\n", a);*/
//	
//	//float a = 6.0 / 5;//除号表达式两侧至少有一个是浮点数的形式
//	//warning C4305: “初始化”: 从“double”到“float”截断
//	
//	float a = 6.0f / 5.0f;//去掉警告
//	printf("%f\n", a);
//	
//	return 0;
//}


//取模操作符
//int main()
//{
//	int a = 7 % 3;//算的是除之后的余数
//    printf("%d\n", a);
//
//	return 0;
//}

//移位操作符
//左移<< 
//int main()
//{
//	int a = 2;
//	int b = a << 1;//把a的二进制位向左移动一位
//
//	printf("b = %d\n", b);
//
//	return 0;
//}

//右移 >>
//int main()
//{
//	int a = -1;
//	int b = a >> 1;//把a的二进制位向右移动一位
//	//分两种
//	//1.算术右移//右边丢弃，左边补原符号位
//	//2.逻辑右移//右边丢弃，左边补0
//	printf("b = %d\n", b);//从结果可以看出，当前的右移操作符使用的是算数右移
//  
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int b = a << -5;//废代码，垃圾代码//error
//
//	return 0;
//}

//位操作符

//int main()
//{
//	int a = 3;
//	int b = 5;

	//  ^ - 按位（2进制）异或
	//对应的2进制位进行异或
	//规则：相同位0.相异位1
	//int c = a ^ b;
	//
    //00000000000000000000000000000011
    //00000000000000000000000000000101
	//00000000000000000000000000000110
	//
	
	//  | - 按位（2进制）或
	//int c = a | b;
	//
	//00000000000000000000000000000011
	//00000000000000000000000000000101
	//00000000000000000000000000000111
	//
	
	//& - 按位（2进制）与
	//int c = a & b;
	//
	//00000000000000000000000000000011
	//00000000000000000000000000000101
	//00000000000000000000000000000001
	//
//	printf("%d", c);
//
//	return 0;
//}


//例子：交换两个int变量的值，不能使用第三个变量。即a=3，b=5，交换之后a=5.b=3

//方法一：
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//交换
//	int c = 0;//空瓶//然而这种写法不满足题目的要求 - 不能创建第三个变量
//	printf("a = %d b = %d\n", a, b);
//	c = a;
//	a = b;
//	b = c;
//	printf("a = %d b = %d\n", a, b);
//
//	return 0;
//}

//方法二：
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//
//	printf("a = %d b = %d\n", a, b);
//	a = a + b;//a中存入a、b的和
//	b = a - b;//即a、b的和 减去 b 得a的值，赋给变量b
//	a = a - b;//此时变量b已经改变为a的值，故a、b的和 减去 a 得b的值，赋给变量a
//	//经上述步骤，完成交换
//	printf("a = %d b = %d\n", a, b);
//	//缺陷，数值太大会溢出//整型int最大有上限，二者的和有可能超出整型的最大的
//	return 0;
//}

//方法三：
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//异或//交换
//	printf("a = %d b = %d\n", a, b);
//	a = a ^ b;//通过异或运算符，改变二进制，间接实现数字的交换
//	b = a ^ b;//a = a^b^b
//	a = a ^ b;//异或的过程中，没有可能产生进位，再大的数字也不会溢出
//
//	printf("a = %d b = %d\n", a, b);
//	return 0;
//}

//科普异或//不明白的可以看 P69操作符详解 第58min
//int main()
//{
//	int a = 3;
//	
//	//0 ^ a = a;//0和任何一个数字异或都是它本身
//	//000
//	//011
//	//011
//	
//	//a ^ a = 0;//相同数字异或得0
//	//011
//	//011
//	//000
//
//	printf("a = %d\n", a);
//	return 0;
//}

//练习
//编写代码实现：求一个整数存储在内存中的二进制中1的个数。
//通过移位和按位与的操作，可以实现求二进制中1的个数//十分巧妙
//int main()
//{
//	int a = 13;//此处//如何从十进制转化成二进制，掌握手算法
//	//00000000000000000000000000001101
//	//00000000000000000000000000000001
//	//00000000000000000000000000000001
//	//& >>
//	//考验逻辑，还需要磨炼这方面的技能
//	//此处只讲大概的思路，具体实现自己完成
//	//按二进制运算的时候，符号位也要考虑
//	return 0;
//}

//int main()
//{
//	int a = 13;
//	//把a的2进制中的第5位 置成0
//	a = a | (1 << 4);//用位运算符，通过二进制上的运算，改变了数字的值
//	printf("a = %d\n", a);
//	//把a的2进制中的第5位 置成0
//	a = a & ~(1 << 4);
//	printf("a = %d\n", a);//改回来了
//	//
//	//00000000000000000000000000001101
//	//00000000000000000000000000010000
//	//00000000000000000000000000011101
//	//
//	//1<<4
//	//00000000000000000000000000000001
//
//	//00000000000000000000000000011101
//	//11111111111111111111111111101111
//	//00000000000000000000000000010000
//	// 
//	//00000000000000000000000000001101
//	// 
//	//1<<4
//
//	return 0;
//}

//赋值操作符
// = += -= *= /= >>= <<= %=

//int main()
//{
//	int a = 10;
//	a = 100;
//
//	a = a + 100;//1
//	a += 100;//2//简化写法
//
//	a = a >> 3;
//	a >>= 3;
//
//	return 0;
//}
//=  -- 赋值
//== -- 判断


//单目操作符 - 只有一个操作数
//int main()
//{
//	int flag = 0;
//	printf("%d\n", !flag);//!flag 假变真 0变1 //真变假 非0变0
	//flag为真，打印hehe
	//if (flag)
	//{
	//	printf("hehe\n");
	//}
    //flag为假，打印haha
	//if (!flag)
	//{
	//	printf("haha\n");
	//}
//	return 0;
//}

// - 
//int main()
//{
//	int a = 10;
//	a = -a;
//
//	printf("%d\n", a);
//	return 0;
//}

//sizeof//计算和统计类型的长度
//int main()
//{
//	short s = 5;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 2));//sizeof括号中放的表达式是不参与运算的
//	printf("%d\n", s);//
	
	
	//int a = 10;
	//int arr[10] = { 0 };
	//printf("%d\n", sizeof(arr));//也可以用来计算数组大小//单位是字节
	//printf("%d\n", sizeof(int [10]));//10- int [10]是arr数组类型

	//printf("%d\n", sizeof(a));//计算a所占空间的大小，单位是字节
	//printf("%d\n", sizeof(int));
	//printf("%d\n", sizeof a);//计算变量的大小可以省略（）
	//printf("%d\n", sizeof int);//但是类型的（）不能省略
	//（）可以省略证明了sizeof是个操作符，而不是函数

//	return 0;
//}


// ~ 对一个数的2进制位按位取反

//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001 - 原码
//	//11111111111111111111111111111110 - 反码
//	//11111111111111111111111111111111 - 补码//此处作为常识记住
//
//	int b = ~a;//按位取反//包括符号位
//	//11111111111111111111111111111111
//	//00000000000000000000000000000000
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}


//++ --
int main()
{
	int a = 10;
	printf("%d\n", a--);//后置--，先使用,再--//即使在（）里
	printf("%d\n", a);
	
	//int b = a++;//后置++，先使用,再++
	//int b = ++a;//前置++，先++,再使用
	//int b = a--; //后置--，先使用,再--
	//int b = --a; //前置--，先--,再使用

	//printf("b = %d\n", b);//
	//printf("a = %d\n", a);//

	return 0;
}//++ --了解到这里就可以了，不要过度妖魔化

//垃圾代码 - 不要学
//int main()
//{
//	int a = 1;
//	int b = (++a) + (++a) + (++a);//这段代码是有问题的//在Linux跑出10//垃圾代码
//	printf("%d\n", b);
//
//
//	return 0;
//}