#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//补2021-05-16_8-使用调试技巧（初阶）_作业
//第1题 编程题
//strlen实现
//题目：模拟实现库函数strlen
//以前写过，找出来看看

//第2题 编程题
//strcpy实现
//题目：模拟实现库函数strcpy
//以前写过，找出来看看


//2021-05-21_9.数据的存储（进阶）_作业
//第2题
//程序执行的结果是？
//int main()
//{
//	//unsigned char 0-255
//	unsigned char a = 200;
//	//00000000000000000000000011001000
//	//11001000
//	unsigned char b = 100;
//	//00000000000000000000000001100100
//	//01100100
//	unsigned char c = 0;
//	//a和b整型提升
//	//00000000000000000000000011001000
//	//00000000000000000000000001100100
//	//虽然没有变化，但是过程还是要有的
//	c = a + b;
//	//00000000000000000000000100101100
//	//00101100
//
//	printf("%d %d", a + b, c);//字符型也是整型的一种
//	//a+b并没有放到c中时 300 没有发生截断
//	//c 中发生截断 44
//	return 0;
//}//300 44

//第3题
//下列代码在32位大端模式处理器上变量b等于（）
//int main()
//{
//	//回忆大小端
//	unsigned int a = 0x1234; unsigned char b = *(unsigned char*)&a;
//	return 0;
//}//00

//第4题
//讲过循环255次

//第6题 编程题
//杨辉三角
//题目：在屏幕上打印杨辉三角
//1
//1 1
//1 2 1
//1 3 3 1
//1 4 6 4 1
// 1 5 10 10 5 1
//int main()
//{
//	int arr[10][10] = { 0 };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			if (j == 0)//第一列
//			{
//				arr[i][j] = 1;
//			}
//			if (i == j)//对角线
//			{
//				arr[i][j] = 1;
//			}
//			if (i >= 2 && j >= 1)
//			{
//				arr[i][j] = arr[i - 1][j - 1] + arr[i - 1][j];
//			}
//		}
//	}
//	for (i = 0; i < 10; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}

//第7题 编程题
//猜凶手
//题目：日本某地发生了一起谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个
//以下为4个嫌疑犯的供词
//A说：不是我
//B说：是C
//C说：是D
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话
//现在请根据这些信息，写一个程序来确定到底谁是凶手
//int main()
//{
//	char killer = 0;
//	for (killer = 'A'; killer <= 'D'; killer++)//巧妙的利用ASCII码
//	{
//		if ((killer != 'A') + (killer == 'C') + (killer == 'D') + (killer != 'D') == 3)
//		{
//			//巧妙的利用真假的判断将最后的凶手输出
//			printf("%c\n", killer);
//		}
//	}
//	return 0;
//}//将分析问题的方法转换成代码 - 像说话一样运用代码

//第8题 编程题
//猜名次
//题目：5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果：
//A：B第二，我第三
//B：我第二，E第四
//C：我第一，D第二
//D：C最后，我第三
//E：我第四，A第一
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次
int main()
{
	int a = 0;
	int b = 0;
	int c = 0;
	int d = 0;
	int e = 0;
	for (a = 1; a <= 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			for (c = 1; c <= 5; c++)
			{
				for (d = 1; d <= 5; d++)
				{
					for (e = 1; e <= 5; e++)
					{
						if (
							((b == 2) + (a == 3) == 1)
							&& ((b == 2) + (e == 4) == 1)
							&& ((c == 1) + (d == 2) == 1)
							&& ((c == 5) + (d == 3) == 1)
							&& ((e == 4) + (a == 1) == 1)
							)
						{
							if (a * b * c * d * e == 120)
							printf("a=%d b=%d c=%d d=%d e=%d\n", a, b, c, d, e);
						}
					}
				}
			}
		}

	}
	return 0;
}




//第9题 简答题
//课堂代码练习与本主题博客
//题目：
//1.请同学们自主完成课堂代码的编写
//2.根据本节课讲解，将涉及到的核心知识点，进行整理并编写一篇博客
//3.以博客链接的方式，提交博客作业