#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//二维数组的创建和初始化

//int main()
//{
	//创建
	//int arr[3][4];//3行4列 - 二维数组，每个元素都是int类型 - 之所以叫二维，是因为有行和列的区分
	//char ch[3][10];//每个元素都是char类型
	
	//初始化 - 创建的同时给赋值
	//int arr[3][4] = {1,2,3,4,5,6,7,8,9,10,11,12};
	//int arr[3][4] = { 1,2,3,4,5,6,7 };//不完全初始化 - 后面补0 - 字符型补'\0'
	//int arr[3][4] = { {1,2},{3,4},{4,5} };//{}就一行一行的放
	
	//二维数组的使用
	//int arr[][4] = { {1,2},{3,4},{4,5} };//二维数组行可以省略，列不可以省略
	//               //有3个{}表示有3行
	////二维数组的元素下标的行、列都是从0开始的
	//int i = 0;
	//int j = 0;
	//for (i = 0; i < 3; i++)
	//{
	//	for (j = 0; j < 4; j++)
	//	{
	//		printf("%d ", arr[i][j]);//打印第i行元素
	//	}
	//	printf("\n");//换一行
	//}


	//二维数组在数组中的存储
	//int arr[][4] = { {1,2},{3,4},{4,5} };
	//int i = 0;
	//int j = 0;	
	//int* p = &arr[0][0];//指针变量 - 存放地址 - 解引用，找到指向的对象

	//for (i = 0; i < 12; i++)
	//{
	//	printf("%d ", *p);
	//	p++;
	//}

	//for (i = 0; i < 3; i++)
	//{
	//	for (j = 0; j < 4; j++)
	//	{
	//		printf("&arr[%d][%d] = %p\n", i, j, &arr[i][j]);//打印一行的每个元素的地址
	//	}                        //%p - 按地址格式打印
	//}
//	return 0;
//}
//二维数组在内存中也是连续存放的
//一行中的元素时连续的，跨行也是连续的

//数组作为函数参数
//冒泡排序的思想：
//两两相邻的元素进行比较，并且可能的haul需要交换
// 
 
//void bubble_sort(int arr[],int sz)//形参arr本质是指针
//{
//	//计算数组元素个数
//	//int sz = sizeof(arr) / sizeof(arr[0]);//出现问题//sizeof(arr)实际上算的是一个指针变量的大小//解决办法 - 拿到外面去
//	
//	//确定趟数
//	int i = 0;
//	for (i = 0; i < sz - 1; i++)
//	{
//		//一趟冒泡排序的过程
//		int j = 0;
//		for (i = 0; j < sz-1-i; j++)//每次比较都要少一组
//		{
//			if (arr[j] > arr[j + 1]);
//			{
//				//交换
//				int tmp = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = tmp;
//			}
//		}
//	}
//}

//优化
void bubble_sort(int arr[],int sz)//形参arr本质是指针
{
	//确定趟数
	int i = 0;
	for (i = 0; i < sz - 1; i++)
	{
		//一趟冒泡排序的过程
		int j = 0;
		int flag = 1;
		for (j = 0; j < sz-1-i; j++)//j起到标识比较次数的作用
		{
			if (arr[j] > arr[j + 1]);
			{
				//交换
				int tmp = arr[j];//tmp在每次大循环中才会改变值
				arr[j] = arr[j + 1];
				arr[j + 1] = tmp;
				flag = 0;
			}
		}
		if (flag == 1)
		{
			break;
		}
	}
}

int main()
{
	int arr[] = { 9,8,7,6,5,4,3,2,1,0 };
	//排序为升序 - 冒泡排序
	int sz = sizeof(arr) / sizeof(arr[0]);

	bubble_sort(arr,sz);//bubble气泡，水泡的意思//sort排序的意思
	//数组传参的时候，传递的其实是数组首元素的地址

	return 0;
}//这个程序好像有些错误//有机会自己跑一下

//数组名是什么？
//数组名是数组首元素的地址
//但是有2个例外
//1、sizeof(数组名) - 数组名表示整个数组 - 计算的是整个数组的大小，单位是字节
//2、&数组名 - 数组名表示整个数组 - 取出的是整个数组的地址
//
//int main()
//{
//	int arr[10] = { 0 };
//	printf("%p\n", &arr);//1 - 取出的是数组的地址
//	printf("%p\n", &arr+1);//1//0x28 -40
//
//	printf("%p\n", arr);//2
//	printf("%p\n", arr+1);//2//4

    //printf("%p\n", &arr[0]);//3

	//int sz = sizeof(arr);//这个地方的数组名表示整个数组
	//printf("%d\n", sz);

	//printf("%p\n", &arr[0]);
	//printf("%p\n", arr);//数组名是首元素的地址
	//打印结果是一样的

//	return 0;
//}