#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>


//表达式求值
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a + b * 7;
//		
//	return 0;
//}

//整型提升
//int main()
//{
//	char a = 3;
//	//00000000000000000000000000000011
//	//00000011 - a
//	char b = 127;
//	//00000000000000000000000001111111
//	//01111111 - b
//	char c = a + b;
//	//00000000000000000000000000000011
//	//00000000000000000000000001111111
//	//00000000000000000000000010000010
//	
//	//10000010 - c
//	//11111111111111111111111110000010 - 补码
//	//11111111111111111111111110000001 - 反码
//	//10000000000000000000000001111110 - 原码
//	//-126
//
//	//发现a和b都是char类型，都没有达到一个int的大小
//	//这里就会发生整型提升
//	
//	printf("%d\n", c);//-126
//
//	return 0;
//}//涉及到原码、反码、补码之间的转换，需要好好看看

//例1 - 整型提升是存在的
//int main()
//{
//	char a = 0xb6;
//	short b = 0xb600;
//	int c = 0xb6000000;
//	if (a == 0xb6)//没达到一个整型的大小，会整型提升
//		printf("a");
//	if (b == 0x600)//没达到一个整型的大小，会整型提升
//		printf("b");
//	if (c == 0xb6000000)
//		printf("c");
//	return 0;
//}

//例2
//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//	printf("%u\n", sizeof(+c));//4//参与运算，发生整型提升
//	printf("%u\n", sizeof(-c));//4
//	printf("%u\n", sizeof(!c));//1 gcc - 4
//
//	return 0;
//}

int main()
{
	int a = 3;
	int b = 5;
	short s = 5;
	sizeof(s = a + 3);//推导出的s的大小
	a + b;//值类型，类型属性 int

	return 0;
}